;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[PLASMAPISTOL_CV X2WeaponTemplate]
FriendlyName="剃刀型电浆手枪"
FriendlyNamePlural="剃刀型电浆手枪"
BriefSummary="剃刀型电浆手枪在荷鲁斯之乱时期所使用。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>剃刀型电浆手枪在荷鲁斯之乱时期所使用。"
AbilityDescName="电浆手枪"

[PLASMAPISTOL_MG X2WeaponTemplate]
FriendlyName="螺旋波型电浆手枪"
FriendlyNamePlural="螺旋波型电浆手枪"
BriefSummary="螺旋波型电浆手枪是一种粒子电浆手枪，有效射程可达100米。它随后停止了生产，原因是在第五次射击后会加速过热。"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>螺旋波型电浆手枪是一种粒子电浆手枪，有效射程可达100米。\n<Bullet/>它随后停止了生产，原因是在第五次射击后会加速过热。"
AbilityDescName="电浆手枪"

[PLASMAPISTOL_BM X2WeaponTemplate]
FriendlyName="Mk-V怒火型电浆手枪"
FriendlyNamePlural="Mk-V怒火型电浆手枪是比Mk-III日怒型更加紧凑的型号。"
BriefSummary="Mk-V怒火型电浆手枪"
TacticalText="<Bullet/>帝皇之敌一息尚存，则无和平可言...\n<Bullet/>为了帝皇！\n<Bullet/>Mk-V怒火型电浆手枪是比Mk-III日怒型更加紧凑的型号。"
AbilityDescName="电浆手枪"
